In [1]:
import pandas as pd
india_weather =pd.DataFrame({
    'city':['Mumbai','Delhi','Bangalore'],
    'temperature':[32,38,30],
    'humidity':[80,60,78]
})
india_weather

        city  temperature  humidity
0     Mumbai           32        80
1      Delhi           38        60
2  Bangalore           30        78

In [2]:
usa_weather =pd.DataFrame({
    'city':['New york','chicago','orlando'],
    'temperature':[21,14,40],
    'humidity':[68,65,70]
})
usa_weather

       city  temperature  humidity
0  New york           21        68
1   chicago           14        65
2   orlando           40        70

In [4]:
df=pd.concat([india_weather,usa_weather])
df

        city  temperature  humidity
0     Mumbai           32        80
1      Delhi           38        60
2  Bangalore           30        78
0   New york           21        68
1    chicago           14        65
2    orlando           40        70

In [6]:
df=pd.concat([india_weather,usa_weather],ignore_index=True)
df

        city  temperature  humidity
0     Mumbai           32        80
1      Delhi           38        60
2  Bangalore           30        78
3   New york           21        68
4    chicago           14        65
5    orlando           40        70

In [7]:
df=pd.concat([india_weather,usa_weather],keys=["india","usa"])
df

              city  temperature  humidity
india 0     Mumbai           32        80
      1      Delhi           38        60
      2  Bangalore           30        78
usa   0   New york           21        68
      1    chicago           14        65
      2    orlando           40        70

In [9]:
df.loc['india']

        city  temperature  humidity
0     Mumbai           32        80
1      Delhi           38        60
2  Bangalore           30        78

In [10]:
temp =pd.DataFrame({
    'city':['New york','chicago','orlando'],
    'temperature':[21,14,40],
   
})
temp

       city  temperature
0  New york           21
1   chicago           14
2   orlando           40

In [18]:
wind =pd.DataFrame({
    'city':['New york','orlando'],
    'windspeed':[45,35],
   
},index=[0,2])
wind

       city  windspeed
0  New york         45
2   orlando         35

In [13]:
df=pd.concat([temp,wind])
df

       city  temperature  windspeed
0  New york         21.0        NaN
1   chicago         14.0        NaN
2   orlando         40.0        NaN
0  New york          NaN       45.0
1   chicago          NaN       40.0
2   orlando          NaN       35.0

In [19]:
df=pd.concat([temp,wind],axis=1)
df

       city  temperature      city  windspeed
0  New york           21  New york       45.0
1   chicago           14       NaN        NaN
2   orlando           40   orlando       35.0

In [22]:
s = pd.Series(["Humid","dry","Rain"], name="event")
s

0    Humid
1      dry
2     Rain
Name: event, dtype: object

In [23]:
df =pd.concat([temp,s],axis=1)
df

       city  temperature  event
0  New york           21  Humid
1   chicago           14    dry
2   orlando           40   Rain